ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_spi_protocol.c
/*
 * Copyright 2019 Cypress Semiconductor Corporation
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 *     http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/** @file
 *  Broadcom WLAN SPI Protocol interface
 *
 *  Implements the WHD Bus Protocol Interface for SPI
 *  Provides functions for initialising, de-intitialising 802.11 device,
 *  sending/receiving raw packets etc
 */

#include <stdlib.h>
#include <string.h>  /* For memcpy */

#include "cy_result.h"
#include "cyabs_rtos.h"

#include "whd_thread.h"
#include "whd_chip.h"
#include "whd_sdpcm.h"
#include "whd_chip_constants.h"
#include "whd_int.h"
#include "whd_bus_spi_protocol.h"
#include "whd_bus_common.h"
#include "whd_chip_reg.h"
#include "whd_debug.h"
#include "whd_bus.h"
#include "whd_spi.h"
#include "whd_sdio.h"
#include "whd_buffer_api.h"
#include "whd_debug.h"
#include "whd_types_int.h"
#include "whd_bus_types.h"



/******************************************************
*             Constants
******************************************************/

#define F2_READY_TIMEOUT_MS    (1000)
#define F2_READY_TIMEOUT_LOOPS (1000)
#define F1_READY_TIMEOUT_LOOPS (1000)
#define FEADBEAD_TIMEOUT_MS    (500)
#define ALP_AVAIL_TIMEOUT_MS   (100)

/* function 1 OCP space */
#define SBSDIO_SB_OFT_ADDR_MASK  0x07FFF /* sb offset addr is <= 15 bits, 32k */
#define SBSDIO_SB_OFT_ADDR_LIMIT  0x08000
#define SBSDIO_SB_ACCESS_2_4B_FLAG  0x08000 /* with b15, maps to 32-bit SB access */

#define HT_AVAIL_TIMEOUT_MS    (1000)

/* Taken from FALCON_5_90_195_26 dhd/sys/dhd_sdio.c. For 43362, MUST be >= 8 and word-aligned otherwise dongle fw crashes */
#define SPI_F2_WATERMARK       (32)

#define GSPI_PACKET_AVAILABLE  (1 << 8)
#define GSPI_UNDERFLOW         (1 << 1)

#define SWAP32_16BIT_PARTS(val) ( (uint32_t)( ( ( (uint32_t)(val) ) >> 16 ) + \
                                              ( ( ( (uint32_t)(val) ) & 0xffff ) << 16 ) ) )

#define WHD_BUS_GSPI_PACKET_OVERHEAD    (sizeof(whd_buffer_header_t) )

#define MAX_GSPI_TRANSFER_LEN  2048

#define H32TO16LE(x)           ( ( uint32_t )( ( ( ( uint32_t )(x) & ( uint32_t )0x000000ffU ) << 8 ) | \
                                               ( ( ( uint32_t )(x) & ( uint32_t )0x0000ff00U ) >> 8 ) | \
                                               ( ( ( uint32_t )(x) & ( uint32_t )0x00ff0000U ) << 8 ) | \
                                               ( ( ( uint32_t )(x) & ( uint32_t )0xff000000U ) >> 8 ) ) )

#define WHD_THREAD_POLL_TIMEOUT      (CY_RTOS_NEVER_TIMEOUT)

#define WHD_THREAD_POKE_TIMEOUT      (100)

typedef enum
{
    GSPI_INCREMENT_ADDRESS = 1, GSPI_FIXED_ADDRESS = 0
} gspi_transfer_access_t;

/******************************************************
*             Structures
******************************************************/

#pragma pack(1)

typedef struct
{
    whd_bus_gspi_header_t header;
    uint8_t response_delay[4];
} gspi_backplane_f1_read_header_t;

#pragma pack()

typedef struct
{
    gspi_backplane_f1_read_header_t gspi_header;
    uint32_t data[1];
} gspi_backplane_f1_read_packet_t;

/******************************************************
*             Static variables
******************************************************/

static const uint8_t whd_bus_gspi_command_mapping[] = { 0, 1 };

/******************************************************
*             Structures
******************************************************/
struct whd_bus_priv
{
    whd_spi_config_t spi_config;
    void *spi_obj;
    whd_spi_funcs_t *spi_ops;

};

/******************************************************
*             Variables
******************************************************/

/******************************************************
*             Static Function Declarations
******************************************************/

static whd_result_t whd_spi_download_firmware(whd_driver_t whd_driver);
static whd_result_t whd_bus_spi_transfer_buffer(whd_driver_t whd_driver, whd_bus_transfer_direction_t direction,
                                                whd_bus_function_t function, uint32_t address, whd_buffer_t buffer);

/******************************************************
*             SPI Logging
* Enable this section for logging of SPI transfers
* by changing "if 0" to "if 1"
******************************************************/
#if 0

#define GSPI_LOG_SIZE        (110)
#define SDIO_LOG_HEADER_SIZE (0)   /*(0x30) */

typedef enum
{
    UNUSED,
    LOG_TX,
    LOG_RX
}gspi_log_direction_t;

typedef struct gSPI_log_entry_struct
{
    gspi_log_direction_t direction;
    whd_bus_function_t function;
    uint32_t address;
    unsigned long time;
    unsigned long length;
#if (SDIO_LOG_HEADER_SIZE != 0)
    unsigned char header[GSPI_LOG_HEADER_SIZE];
#endif /* if ( SDIO_LOG_HEADER_SIZE != 0 ) */
}gspi_log_entry_t;

static int next_gspi_log_pos = 0;
static gspi_log_entry_t gspi_log_data[GSPI_LOG_SIZE];

static void add_log_entry(gspi_log_direction_t dir, whd_bus_function_t function, uint32_t address, unsigned long length,
                          char *gspi_data)
{
    UNUSED_PARAMETER(gspi_data);
    gspi_log_data[next_gspi_log_pos].direction = dir;
    gspi_log_data[next_gspi_log_pos].function = function;
    gspi_log_data[next_gspi_log_pos].address = address;
    cy_rtos_get_time(&gspi_log_data[next_gspi_log_pos].time);
    gspi_log_data[next_gspi_log_pos].length = length;
#if (SDIO_LOG_HEADER_SIZE != 0)
    memcpy(gspi_log_data[next_gspi_log_pos].header, gspi_data,
           (length >= GSPI_LOG_HEADER_SIZE) ? GSPI_LOG_HEADER_SIZE : length);
#endif /* if ( SDIO_LOG_HEADER_SIZE != 0 ) */
    next_gspi_log_pos++;
    if (next_gspi_log_pos >= GSPI_LOG_SIZE)
    {
        next_gspi_log_pos = 0;
    }
}

#else
#define add_log_entry(dir, function, address, length, gspi_data)
#endif

/******************************************************
*             Global Function definitions
******************************************************/

