ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_spi_protocol.c
uint32_t whd_bus_spi_attach(whd_driver_t whd_driver, whd_spi_config_t *whd_spi_config, void *spi_obj,
                            whd_spi_funcs_t *spi_ops)
{
    struct whd_bus_info *whd_bus_info;

    if ( (spi_ops == NULL) || (spi_ops->whd_enable_intr == NULL) || (spi_ops->whd_get_intr_config == NULL) )
    {
        WPRINT_WHD_ERROR( ("oob interrupt configuration is invalid in %s\n", __FUNCTION__) );
        return WHD_BADARG;
    }

    whd_bus_info = (whd_bus_info_t *)malloc(sizeof(whd_bus_info_t) );

    if (whd_bus_info == NULL)
    {
        WPRINT_WHD_ERROR( ("Memory allocation failed for whd_bus_info in %s\n", __FUNCTION__) );
        return WHD_BUFFER_UNAVAILABLE_PERMANENT;
    }
    memset(whd_bus_info, 0, sizeof(whd_bus_info_t) );

    whd_driver->bus_if = whd_bus_info;

    whd_driver->bus_priv = (struct whd_bus_priv *)malloc(sizeof(struct whd_bus_priv) );

    if (whd_driver->bus_priv == NULL)
    {
        WPRINT_WHD_ERROR( ("Memory allocation failed for whd_bus_priv in %s\n", __FUNCTION__) );
        return WHD_BUFFER_UNAVAILABLE_PERMANENT;
    }
    memset(whd_driver->bus_priv, 0, sizeof(struct whd_bus_priv) );

    /* Pass the SPI object to bus private spi_obj pointer */
    whd_driver->bus_priv->spi_obj = spi_obj;
    whd_driver->bus_priv->spi_config = *whd_spi_config;
    whd_driver->bus_priv->spi_ops = spi_ops;

    whd_bus_info->whd_bus_init_fptr = whd_bus_spi_init;
    whd_bus_info->whd_bus_deinit_fptr = whd_bus_spi_deinit;

    whd_bus_info->whd_bus_write_backplane_value_fptr = whd_bus_spi_write_backplane_value;
    whd_bus_info->whd_bus_read_backplane_value_fptr = whd_bus_spi_read_backplane_value;
    whd_bus_info->whd_bus_write_register_value_fptr = whd_bus_spi_write_register_value;
    whd_bus_info->whd_bus_read_register_value_fptr = whd_bus_spi_read_register_value;

    whd_bus_info->whd_bus_send_buffer_fptr = whd_bus_spi_send_buffer;
    whd_bus_info->whd_bus_transfer_bytes_fptr = whd_bus_spi_transfer_bytes;

    whd_bus_info->whd_bus_read_frame_fptr = whd_bus_spi_read_frame;

    whd_bus_info->whd_bus_packet_available_to_read_fptr = whd_bus_spi_packet_available_to_read;
    whd_bus_info->whd_bus_poke_wlan_fptr = whd_bus_spi_poke_wlan;
    whd_bus_info->whd_bus_wait_for_wlan_event_fptr = whd_bus_spi_wait_for_wlan_event;

    whd_bus_info->whd_bus_ack_interrupt_fptr = whd_bus_spi_ack_interrupt;
    whd_bus_info->whd_bus_wake_interrupt_present_fptr = whd_bus_spi_wake_interrupt_present;

    whd_bus_info->whd_bus_wakeup_fptr = whd_bus_spi_wakeup;
    whd_bus_info->whd_bus_sleep_fptr = whd_bus_spi_sleep;

    whd_bus_info->whd_bus_backplane_read_padd_size_fptr = whd_bus_spi_backplane_read_padd_size;
    whd_bus_info->whd_bus_use_status_report_scheme_fptr = whd_bus_spi_use_status_report_scheme;

    whd_bus_info->whd_bus_get_max_transfer_size_fptr = whd_bus_spi_get_max_transfer_size;

    whd_bus_info->whd_bus_init_stats_fptr = whd_bus_spi_init_stats;
    whd_bus_info->whd_bus_print_stats_fptr = whd_bus_spi_print_stats;
    whd_bus_info->whd_bus_reinit_stats_fptr = whd_bus_spi_reinit_stats;
    whd_bus_info->whd_bus_irq_register_fptr = whd_bus_spi_irq_register;
    whd_bus_info->whd_bus_irq_enable_fptr = whd_bus_spi_irq_enable;

    return WHD_SUCCESS;
}

whd_result_t whd_bus_spi_send_buffer(whd_driver_t whd_driver, whd_buffer_t buffer)
{
    whd_result_t result = whd_bus_spi_transfer_buffer(whd_driver, BUS_WRITE, WLAN_FUNCTION, 0, buffer);
    CHECK_RETURN(whd_buffer_release(whd_driver, buffer, WHD_NETWORK_TX) );
    if (result == WHD_SUCCESS)
    {
        DELAYED_BUS_RELEASE_SCHEDULE (whd_driver, WHD_TRUE);
    }
    CHECK_RETURN(result);

    return WHD_SUCCESS;
}

/*
 * Perform a transfer on the gSPI bus
 * Prerequisites: length < MAX_GSPI_TRANSFER_LEN
 */
static whd_result_t whd_bus_spi_transfer_buffer(whd_driver_t whd_driver, whd_bus_transfer_direction_t direction,
                                                whd_bus_function_t function, uint32_t address, whd_buffer_t buffer)
{
    uint32_t *temp;
    whd_result_t result;
    uint16_t newsize;
    whd_buffer_header_t *header = (whd_buffer_header_t *)whd_buffer_get_current_piece_data_pointer(whd_driver, buffer);
    whd_bus_gspi_header_t *gspi_header =
        (whd_bus_gspi_header_t *)( (char *)header->bus_header + MAX_BUS_HEADER_SIZE - sizeof(whd_bus_gspi_header_t) );
    size_t transfer_size;

    uint16_t size = ( uint16_t )(whd_buffer_get_current_piece_size(whd_driver, buffer) - sizeof(whd_buffer_header_t) );

    /* Form the gSPI header */
    *gspi_header =
        ( whd_bus_gspi_header_t )( ( uint32_t )( (whd_bus_gspi_command_mapping[(int)direction] & 0x1) << 31 ) |
                                   ( uint32_t )( (GSPI_INCREMENT_ADDRESS & 0x1) << 30 ) |
                                   ( uint32_t )( (function & 0x3) << 28 ) |
                                   ( uint32_t )( (address & 0x1FFFF) << 11 ) | ( uint32_t )( (size & 0x7FF) << 0 ) );

    /* Reshuffle the bits if we're not in 32 bit mode */
    if (whd_driver->bus_gspi_32bit == WHD_FALSE)
    {
        /* Note: This typecast should always be valid if the buffer containing the GSpi packet has been correctly declared as 32-bit aligned */
        temp = (uint32_t *)gspi_header;
        *temp = H32TO16LE(*temp);
    }

    /* Round size up to 32-bit alignment */
    newsize = (uint16_t)ROUND_UP(size, 4);

    /* Send the data */
    if (direction == BUS_WRITE)
    {
        /* Wait for FIFO to be ready to accept data */
        if (function == WLAN_FUNCTION)
        {
            uint32_t whd_bus_gspi_status;
            uint32_t loop_count = 0;
            while ( ( (result =
                           whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_STATUS_REGISTER, (uint8_t)4,
                                                           (uint8_t *)&whd_bus_gspi_status) ) == WHD_SUCCESS ) &&
                    ( (whd_bus_gspi_status & (1 << 5) ) == 0 ) &&
                    (loop_count < ( uint32_t )F2_READY_TIMEOUT_LOOPS) )
            {
                loop_count++;
            }
            if (result != WHD_SUCCESS)
            {
                WPRINT_WHD_ERROR( ("Error reading register value, %s failed at %d \n", __func__, __LINE__) );
                return result;
            }
            if (loop_count >= ( uint32_t )F2_READY_TIMEOUT_LOOPS)
            {
                WPRINT_WHD_ERROR( ("Timeout waiting for data FIFO to be ready\n") );
                return WHD_TIMEOUT;
            }
        }

