ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_spi_protocol.c
        add_log_entry(LOG_TX, function, address, size, (char *)&gspi_header->data);
    }

    transfer_size = (size_t)(newsize + sizeof(whd_bus_gspi_header_t) );

    /* Send the data */
    if (direction == BUS_READ)
    {
        result = cyhal_spi_transfer(whd_driver->bus_priv->spi_obj, NULL, 0, (uint8_t *)gspi_header,
                                    transfer_size, 0);
    }
    else
    {
        result = cyhal_spi_transfer(whd_driver->bus_priv->spi_obj, (uint8_t *)gspi_header, transfer_size, NULL,
                                    0, 0);
    }

    if (direction == BUS_READ)
    {
        add_log_entry(LOG_RX, function, address, size, (char *)&gspi_header->data);
    }

    return result;
}

whd_result_t whd_bus_spi_poke_wlan(whd_driver_t whd_driver)
{
    return WHD_SUCCESS;
}

whd_result_t whd_bus_spi_ack_interrupt(whd_driver_t whd_driver, uint32_t intstatus)
{
    return whd_bus_write_register_value(whd_driver, BUS_FUNCTION, SPI_INTERRUPT_REGISTER, (uint8_t)2, intstatus);
}

uint32_t whd_bus_spi_packet_available_to_read(whd_driver_t whd_driver)
{
    uint16_t interrupt_register;

    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );

    /* Read the interrupt register */
    if (whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_INTERRUPT_REGISTER, (uint8_t)2,
                                        (uint8_t *)&interrupt_register) != WHD_SUCCESS)
    {
        goto return_with_error;
    }

    if ( (interrupt_register & 0x0086) != 0 )   /* This should be 0x87, but occasional "data not available" errors are flagged seemingly for no reason */
    {
        /* Error condition detected */
        WPRINT_WHD_DEBUG( ("Bus error condition detected\n") );
    }

    /* Clear interrupt register */
    if (interrupt_register != 0)
    {
        if (whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_INTERRUPT_REGISTER, (uint8_t)2,
                                             interrupt_register) != WHD_SUCCESS)
        {
            goto return_with_error;
        }
    }

    return ( uint32_t )( (interrupt_register) & (F2_PACKET_AVAILABLE) );

return_with_error: whd_assert("Error accessing backplane", 0 != 0);
    return 0;
}

whd_result_t whd_bus_spi_read_frame(whd_driver_t whd_driver, whd_buffer_t *buffer)
{
    uint32_t whd_bus_gspi_status;
    whd_result_t result;
    uint32_t whd_gspi_bytes_pending;

    /* Ensure the wlan backplane bus is up */
    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );

    do
    {
        result = whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_STATUS_REGISTER, (uint8_t)4,
                                                 (uint8_t *)&whd_bus_gspi_status);
        if (result != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("Error reading register value, %s failed at %d \n", __func__, __LINE__) );
            return result;
        }
    } while (whd_bus_gspi_status == 0xFFFFFFFF);

    if ( (whd_bus_gspi_status & GSPI_PACKET_AVAILABLE) != 0 )
    {
        if ( ( ( (whd_bus_gspi_status >> 9) & 0x7FF ) == 0 ) ||
             ( ( (whd_bus_gspi_status >> 9) & 0x7FF ) > (WHD_LINK_MTU - WHD_BUS_GSPI_PACKET_OVERHEAD) ) ||
             (whd_bus_gspi_status & GSPI_UNDERFLOW) )
        {
            CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BACKPLANE_FUNCTION, SPI_FRAME_CONTROL, 1,
                                                          (1 << 0) ) );
            return WHD_NO_PACKET_TO_RECEIVE;
        }
    }

    whd_gspi_bytes_pending = 0;

    if ( (whd_bus_gspi_status & GSPI_PACKET_AVAILABLE) != 0 )
    {
        whd_gspi_bytes_pending = ( (whd_bus_gspi_status >> 9) & 0x7FF );
    }

    if (whd_gspi_bytes_pending == 0)
    {
        return WHD_NO_PACKET_TO_RECEIVE;
    }

    /* Allocate a suitable buffer */
    result = whd_host_buffer_get(whd_driver, buffer, WHD_NETWORK_RX,
                                 (unsigned short)(whd_gspi_bytes_pending + WHD_BUS_GSPI_PACKET_OVERHEAD), WHD_FALSE);

    if (result != WHD_SUCCESS)
    {
        /* Read out the first 12 bytes to get the bus credit information */
        uint8_t temp_buffer[12 + MAX_BUS_HEADER_SIZE];
        CHECK_RETURN(whd_bus_spi_transfer_bytes(whd_driver, BUS_READ, WLAN_FUNCTION, 0, 12,
                                                (whd_transfer_bytes_packet_t *)temp_buffer) );

        /* Abort the transfer to force the packet to be dropped */
        if (whd_gspi_bytes_pending > 12)
        {
            CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BACKPLANE_FUNCTION, SPI_FRAME_CONTROL, 1,
                                                          (1 << 0) ) );
        }

        /* Process bus data credit information */
        whd_sdpcm_update_credit(whd_driver, (uint8_t *)(temp_buffer + sizeof(whd_bus_header_t) ) );
        WPRINT_WHD_ERROR( ("Packet buffer allocation failed in %s at %d \n", __func__, __LINE__) );
        return result;
    }

    result = whd_bus_spi_transfer_buffer(whd_driver, BUS_READ, WLAN_FUNCTION, 0, *buffer);
    if (result != WHD_SUCCESS)
    {
        CHECK_RETURN(whd_buffer_release(whd_driver, *buffer, WHD_NETWORK_RX) );
        WPRINT_WHD_ERROR( ("SPI buffer transfer failed in %s at %d \n", __func__, __LINE__) );
        return result;
    }

    DELAYED_BUS_RELEASE_SCHEDULE (whd_driver, WHD_TRUE);
    return WHD_SUCCESS;
}

whd_result_t whd_bus_spi_init(whd_driver_t whd_driver)
{
    uint32_t data = 0;
    uint32_t whd_bus_gspi_status;
    uint16_t data16 = 0;
    uint32_t loop_count;
    whd_result_t result;
    uint8_t init_data[12] = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
    uint32_t interrupt_polarity = 0;
    uint16_t chip_id;
    size_t transfer_size = 12;
    whd_intr_config_t config;

    whd_driver->bus_gspi_32bit = WHD_FALSE;

    (*whd_driver->bus_priv->spi_ops->whd_get_intr_config)(whd_driver,
                                                          whd_driver->bus_priv->spi_config.oob_intr,
                                                          &config);

    if (config.is_falling_edge == WHD_FALSE)
        interrupt_polarity = INTERRUPT_POLARITY_HIGH;

    whd_bus_init_backplane_window(whd_driver);

    whd_bus_gspi_header_t *gspi_header = (whd_bus_gspi_header_t *)init_data;

