ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_spi_protocol.c
    /* Due to an chip issue, the first transfer will be corrupted.
     * This means a repeated safe read of a known value register is required until
     * the correct value is returned - signalling the bus is running.
     * This known value register must be accessed using fixed (non-incrementing) address
     * mode, hence a custom packet header must be constructed
     * Due to the chip issue, the data received could be left shifted by one bit.
     */
    loop_count = 0;
    do
    {
        /* Header needs to calculated every time as init_data gets modified in cyhal_spi_transfer() */
        *gspi_header =
            ( whd_bus_gspi_header_t )SWAP32_16BIT_PARTS(SWAP32( (uint32_t)( (whd_bus_gspi_command_mapping[(int)BUS_READ]
                                                                             & 0x1) << 31 ) |
                                                                (uint32_t)( (GSPI_FIXED_ADDRESS & 0x1) << 30 ) |
                                                                (uint32_t)( (BUS_FUNCTION & 0x3) << 28 ) |
                                                                (uint32_t)( (SPI_READ_TEST_REGISTER & 0x1FFFFu) <<
                                                                            11 ) |
                                                                (uint32_t)( (4u /*size*/ & 0x7FFu) << 0 ) ) );
        CHECK_RETURN(cyhal_spi_transfer(whd_driver->bus_priv->spi_obj, NULL, 0, init_data, transfer_size, 0) );
        loop_count++;
    } while ( (NULL == memchr(&init_data[4], SPI_READ_TEST_REG_LSB, (size_t)8) ) &&
              (NULL == memchr(&init_data[4], SPI_READ_TEST_REG_LSB_SFT1, (size_t)8) ) &&
              (NULL == memchr(&init_data[4], SPI_READ_TEST_REG_LSB_SFT2, (size_t)8) ) &&
              (NULL == memchr(&init_data[4], SPI_READ_TEST_REG_LSB_SFT3, (size_t)8) ) &&
              (loop_count < ( uint32_t )FEADBEAD_TIMEOUT_MS) &&
              (cy_rtos_delay_milliseconds( (uint32_t)1 ), (1 == 1) ) );

    /* Register interrupt handler */
    whd_bus_spi_irq_register(whd_driver);
    /* Enable SPI IRQ */
    whd_bus_spi_irq_enable(whd_driver, WHD_TRUE);

    /* Keep/reset defaults for registers 0x0-0x4 except for, 0x0: Change word length to 32bit,
     * set endianness, enable wakeup. 0x2: enable interrupt with status. */
#if defined(IL_BIGENDIAN)
    CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, (uint8_t)4,
                                                  (uint32_t)(WORD_LENGTH_32 | (0 & ENDIAN_BIG) |
                                                             (interrupt_polarity & INTERRUPT_POLARITY_HIGH) | WAKE_UP |
                                                             (0x4 << (8 * SPI_RESPONSE_DELAY) ) |
                                                             ( (0 & STATUS_ENABLE) << (8 * SPI_STATUS_ENABLE) ) |
                                                             (INTR_WITH_STATUS << (8 * SPI_STATUS_ENABLE) ) ) ) );
#else
    CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, (uint8_t)4,
                                                  ( uint32_t )(WORD_LENGTH_32 | ENDIAN_BIG |
                                                               (interrupt_polarity & INTERRUPT_POLARITY_HIGH) |
                                                               WAKE_UP | (0x4 << (8 * SPI_RESPONSE_DELAY) ) |
                                                               ( (0 & STATUS_ENABLE) << (8 * SPI_STATUS_ENABLE) ) |
                                                               (INTR_WITH_STATUS << (8 * SPI_STATUS_ENABLE) ) ) ) );
#endif
    whd_driver->bus_gspi_32bit = WHD_TRUE;
    CHECK_RETURN(whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, (uint8_t)4,
                                                 (uint8_t *)&data) );

    if (whd_driver->bus_priv->spi_config.is_spi_normal_mode)
    {
        /* Reset host SPI interface to re-sync */
        /*host_platform_bus_init( );*/
    }

    /* Check feedbead can be read - i.e. the device is alive */
    data = 0;
    CHECK_RETURN(whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_READ_TEST_REGISTER, (uint8_t)4,
                                                 (uint8_t *)&data) );

    if (data != SPI_READ_TEST_REGISTER_VALUE)
    {
        WPRINT_WHD_ERROR( ("Read %x, instead of 0xFEEDBEAD from the WLAN chip\n", (unsigned int)data) );
        return WHD_SPI_ID_READ_FAIL;
    }

    /* Make sure error interrupt bits are clear */
    CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_INTERRUPT_REGISTER, (uint8_t)1,
                                                  ( uint32_t )(DATA_UNAVAILABLE | COMMAND_ERROR | DATA_ERROR |
                                                               F1_OVERFLOW) ) );

    /* Enable a selection of interrupts */
    CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_INTERRUPT_ENABLE_REGISTER, (uint8_t)2,
                                                  ( uint32_t )(F2_F3_FIFO_RD_UNDERFLOW | F2_F3_FIFO_WR_OVERFLOW |
                                                               COMMAND_ERROR | DATA_ERROR | F2_PACKET_AVAILABLE |
                                                               F1_OVERFLOW) ) );

    /* Request ALP */
    CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1,
                                                  SBSDIO_ALP_AVAIL_REQ) );

    /* Wait until ALP is available */
    loop_count = 0;
    while ( ( (result = whd_bus_spi_read_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)2,
                                                        (uint8_t *)&data16) ) == WHD_SUCCESS ) &&
            ( (data16 & SBSDIO_ALP_AVAIL) == 0 ) &&
            (loop_count < ( uint32_t )ALP_AVAIL_TIMEOUT_MS) )
    {
        cy_rtos_delay_milliseconds( (uint32_t)1 );
        loop_count++;
    }
    if (loop_count >= ( uint32_t )ALP_AVAIL_TIMEOUT_MS)
    {
        WPRINT_WHD_ERROR( ("ALP Clock timeout\n") );
        return WHD_TIMEOUT;
    }
    if (result != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("Can't read SDIO_CHIP_CLOCK_CSR\n") );
        return result;
    }

    /* Clear request for ALP */
    CHECK_RETURN(whd_bus_spi_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1,
                                                  (uint32_t)0) );

    /* Read the chip id */
    CHECK_RETURN(whd_bus_spi_read_backplane_value(whd_driver, CHIPCOMMON_BASE_ADDRESS, 2, (uint8_t *)&chip_id) );
    whd_chip_set_chip_id(whd_driver, chip_id);

