ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_spi_protocol.c
    /* Download the firmware */
    result = whd_spi_download_firmware(whd_driver);

    /* user abort */
    if (result == WHD_UNFINISHED)
    {
        /* host_platform_reset_wifi (WHD_TRUE); */
        /* host_platform_power_wifi (WHD_FALSE); */
        WPRINT_WHD_ERROR( ("User aborted download of firmware\n") );
        return result;
    }

    /* non user abort error */
    if (result != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("Could not download firmware\n") );
        return result;
    }
    /* else, successfully downloaded the firmware; continue with waiting for WIFi to live */

    /* Wait for F2 to be ready */
    loop_count = 0;
    while ( ( (result = whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_STATUS_REGISTER, (uint8_t)4,
                                                        (uint8_t *)&whd_bus_gspi_status) ) == WHD_SUCCESS ) &&
            ( (whd_bus_gspi_status & (1 << 5) ) == 0 ) &&
            (loop_count < ( uint32_t )F2_READY_TIMEOUT_MS) )
    {
        cy_rtos_delay_milliseconds( (uint32_t)1 );
        loop_count++;
    }
    if (loop_count >= ( uint32_t )F2_READY_TIMEOUT_MS)
    {
        /* If your system fails here, it could be due to incorrect NVRAM variables.
         * Check which 'wifi_nvram_image.h' file your platform is using, and
         * check that it matches the WLAN device on your platform, including the
         * crystal frequency.
         */
        WPRINT_WHD_ERROR( ("Timeout while waiting for function 2 to be ready\n") );
        return WHD_TIMEOUT;
    }

    CHECK_RETURN(whd_chip_specific_init(whd_driver) );
    CHECK_RETURN(whd_ensure_wlan_bus_is_up(whd_driver) );

    return result;
}

whd_result_t whd_bus_spi_deinit(whd_driver_t whd_driver)
{
    CHECK_RETURN(whd_allow_wlan_bus_to_sleep(whd_driver) );

    /* put device in reset. */
    //host_platform_reset_wifi (WHD_TRUE);
    whd_bus_set_resource_download_halt(whd_driver, WHD_FALSE);
    DELAYED_BUS_RELEASE_SCHEDULE (whd_driver, WHD_FALSE);
    return WHD_SUCCESS;
}

whd_bool_t whd_bus_spi_wake_interrupt_present(whd_driver_t whd_driver)
{
    /* functionality is only currently needed and present on SDIO */
    return WHD_FALSE;
}

whd_result_t whd_bus_spi_wait_for_wlan_event(whd_driver_t whd_driver, cy_semaphore_t *transceive_semaphore)
{
    whd_result_t result = WHD_SUCCESS;
    uint32_t timeout_ms = 1;
    uint32_t delayed_release_timeout_ms;

    REFERENCE_DEBUG_ONLY_VARIABLE(result);

    delayed_release_timeout_ms = whd_bus_handle_delayed_release(whd_driver);
    if (delayed_release_timeout_ms != 0)
    {
        timeout_ms = delayed_release_timeout_ms;
    }
    else
    {
        result = whd_allow_wlan_bus_to_sleep(whd_driver);
        whd_assert("Error setting wlan sleep", (result == WHD_SUCCESS) || (result == WHD_PENDING) );

        if (result == WHD_SUCCESS)
        {
            timeout_ms = CY_RTOS_NEVER_TIMEOUT;
        }
    }

    /* Check if we have run out of bus credits */
    if (whd_sdpcm_get_available_credits(whd_driver) == 0)
    {
        /* Keep poking the WLAN until it gives us more credits */
        result = whd_bus_spi_poke_wlan(whd_driver);
        whd_assert("Poking failed!", result == WHD_SUCCESS);

        result = cy_rtos_get_semaphore(transceive_semaphore, (uint32_t)MIN_OF(timeout_ms,
                                                                              WHD_THREAD_POKE_TIMEOUT), WHD_FALSE);
    }
    else
    {
        result = cy_rtos_get_semaphore(transceive_semaphore, (uint32_t)MIN_OF(timeout_ms,
                                                                              WHD_THREAD_POLL_TIMEOUT), WHD_FALSE);
    }
    whd_assert("Could not get whd sleep semaphore\n", (result == CY_RSLT_SUCCESS) || (result == CY_RTOS_TIMEOUT) );

    return result;
}

/******************************************************
*     Function definitions for Protocol Common
******************************************************/

/*
 * Write a value to a register NOT on the backplane
 * Prerequisites: value_length <= 4
 */
whd_result_t whd_bus_spi_write_register_value(whd_driver_t whd_driver, whd_bus_function_t function, uint32_t address,
                                              uint8_t value_length, uint32_t value)
{
    char gspi_internal_buffer[MAX_BUS_HEADER_SIZE + sizeof(uint32_t) + sizeof(uint32_t)];
    whd_transfer_bytes_packet_t *internal_gspi_packet = (whd_transfer_bytes_packet_t *)gspi_internal_buffer;

    /* Flip the bytes if we're not in 32 bit mode */
    if (whd_driver->bus_gspi_32bit == WHD_FALSE)
    {
        value = H32TO16LE(value);
    }
    /* Write the value and value_length into the packet */
    internal_gspi_packet->data[0] = value;

    /* Send it off */
    return whd_bus_spi_transfer_bytes(whd_driver, BUS_WRITE, function, address, value_length, internal_gspi_packet);
}

/*
 * Read the value of a register NOT on the backplane
 * Prerequisites: value_length <= 4
 */
whd_result_t whd_bus_spi_read_register_value(whd_driver_t whd_driver, whd_bus_function_t function, uint32_t address,
                                             uint8_t value_length, uint8_t *value)
{
    uint32_t *data_ptr;
    whd_result_t result;
    uint8_t padding = 0;

    char gspi_internal_buffer[MAX_BUS_HEADER_SIZE + sizeof(uint32_t) + sizeof(uint32_t)];

    /* Clear the receiving part of memory and set the value_length */
    if (function == BACKPLANE_FUNCTION)
    {
        gspi_backplane_f1_read_packet_t *pkt =
            (gspi_backplane_f1_read_packet_t *)(gspi_internal_buffer + MAX_BUS_HEADER_SIZE -
                                                sizeof(whd_bus_gspi_header_t) );
        data_ptr = pkt->data;
        padding = 4;   /* Add response delay */
    }
    else
    {
        whd_transfer_bytes_packet_t *pkt = (whd_transfer_bytes_packet_t *)gspi_internal_buffer;
        DISABLE_COMPILER_WARNING(diag_suppress = Pa039)
        data_ptr = pkt->data;
        ENABLE_COMPILER_WARNING(diag_suppress = Pa039)
    }

    *data_ptr = 0;
    result =
        whd_bus_spi_transfer_bytes(whd_driver, BUS_READ, function, address, ( uint16_t )(value_length + padding),
                                   (whd_transfer_bytes_packet_t *)gspi_internal_buffer);

    memcpy(value, data_ptr, value_length);

    return result;
}

