ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_WHD/src/bus_protocols/whd_bus_spi_protocol.c
/*
 * Write a value to a register on the backplane
 * Prerequisites: value_length <= 4
 */
whd_result_t whd_bus_spi_write_backplane_value(whd_driver_t whd_driver, uint32_t address, uint8_t register_length,
                                               uint32_t value)
{
    CHECK_RETURN(whd_bus_set_backplane_window(whd_driver, address) );

    address &= SBSDIO_SB_OFT_ADDR_MASK;

    if (register_length == 4)
        address |= SBSDIO_SB_ACCESS_2_4B_FLAG;

    return whd_bus_spi_write_register_value(whd_driver, BACKPLANE_FUNCTION, address, register_length, value);
}

/*
 * Read the value of a register on the backplane
 * Prerequisites: value_length <= 4
 */
whd_result_t whd_bus_spi_read_backplane_value(whd_driver_t whd_driver, uint32_t address, uint8_t register_length,
                                              uint8_t *value)
{
    *value = 0;
    CHECK_RETURN(whd_bus_set_backplane_window(whd_driver, address) );

    address &= SBSDIO_SB_OFT_ADDR_MASK;

    if (register_length == 4)
        address |= SBSDIO_SB_ACCESS_2_4B_FLAG;

    return whd_bus_spi_read_register_value(whd_driver, BACKPLANE_FUNCTION, address, register_length, value);
}

whd_result_t whd_bus_spi_transfer_bytes(whd_driver_t whd_driver, whd_bus_transfer_direction_t direction,
                                        whd_bus_function_t function, uint32_t address, uint16_t size,
                                        whd_transfer_bytes_packet_t *packet)
{
    uint32_t *temp;
    whd_result_t result;
    uint16_t newsize;
    DISABLE_COMPILER_WARNING(diag_suppress = Pa039)
    whd_bus_gspi_header_t *gspi_header =
        (whd_bus_gspi_header_t *)( (char *)packet->data - sizeof(whd_bus_gspi_header_t) );
    ENABLE_COMPILER_WARNING(diag_suppress = Pa039)
    size_t transfer_size;
    *gspi_header =
        ( whd_bus_gspi_header_t )( ( uint32_t )( (whd_bus_gspi_command_mapping[(int)direction] & 0x1) << 31 ) |
                                   ( uint32_t )( (GSPI_INCREMENT_ADDRESS & 0x1) << 30 ) |
                                   ( uint32_t )( (function & 0x3) << 28 ) |
                                   ( uint32_t )( (address & 0x1FFFF) << 11 ) | ( uint32_t )( (size & 0x7FF) << 0 ) );

    /* Reshuffle the bits if we're not in 32 bit mode */
    if (whd_driver->bus_gspi_32bit == WHD_FALSE)
    {
        /* Note: This typecast should always be valid if the buffer
         * containing the GSpi packet has been correctly declared as 32-bit aligned */
        temp = (uint32_t *)gspi_header;
        *temp = H32TO16LE(*temp);
    }

    /* Round size up to 32-bit alignment */
    newsize = (uint16_t)ROUND_UP(size, 4);

    /* Ensure we are clear to write */
    if ( (direction == BUS_WRITE) && (function == WLAN_FUNCTION) )
    {
        uint32_t whd_bus_gspi_status;
        uint32_t loop_count = 0;

        /* Verify the SDPCM size and stated size match */
        DISABLE_COMPILER_WARNING(diag_suppress = Pa039)
        uint16_t *frametag_ptr = (uint16_t *)&packet->data;
        ENABLE_COMPILER_WARNING(diag_suppress = Pa039)
        if (size != *frametag_ptr)
        {
            WPRINT_WHD_DEBUG( ("Error - gSPI size does not match SDPCM size!\n") );
            return WHD_SPI_SIZE_MISMATCH;
        }

        /* Wait for WLAN FIFO to be ready to accept data */
        while ( ( (result =
                       whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_STATUS_REGISTER, (uint8_t)4,
                                                       (uint8_t *)&whd_bus_gspi_status) ) == WHD_SUCCESS ) &&
                ( (whd_bus_gspi_status & (1 << 5) ) == 0 ) &&
                (loop_count < ( uint32_t )F2_READY_TIMEOUT_LOOPS) )
        {
            ++loop_count;
        }

        if (result != WHD_SUCCESS)
        {
            WPRINT_WHD_ERROR( ("Failed to read SPI register value in %s at %d \n", __func__, __LINE__) );
            return result;
        }

        if (loop_count >= ( uint32_t )F2_READY_TIMEOUT_LOOPS)
        {
            WPRINT_WHD_DEBUG( ("Timeout waiting for data FIFO to be ready\n") );
            return WHD_TIMEOUT;
        }

        add_log_entry(LOG_TX, function, address, (unsigned long)size, (char *)&packet->data);
    }

    transfer_size = (size_t)(newsize + sizeof(whd_bus_gspi_header_t) );

    /* Send the data */
    if (direction == BUS_READ)
    {
        result = cyhal_spi_transfer(whd_driver->bus_priv->spi_obj, NULL, 0, (uint8_t *)gspi_header,
                                    transfer_size, 0);
    }
    else
    {
        result = cyhal_spi_transfer(whd_driver->bus_priv->spi_obj, (uint8_t *)gspi_header, transfer_size, NULL,
                                    0, 0);
    }

    if (direction == BUS_READ)
    {
        add_log_entry(LOG_RX, function, address, (unsigned long)( (function == BACKPLANE_FUNCTION) ? size - 4 : size ),
                      (function == BACKPLANE_FUNCTION) ? ( (char *)&packet->data ) + 4 : (char *)&packet->data);
    }

    CHECK_RETURN(result);
    return WHD_SUCCESS;
}

/******************************************************
*             Static  Function definitions
******************************************************/

static whd_result_t whd_spi_download_firmware(whd_driver_t whd_driver)
{
    uint8_t csr_val;
    whd_result_t result;
    uint32_t loop_count = 0;

    CHECK_RETURN(whd_disable_device_core(whd_driver, WLAN_ARM_CORE, WLAN_CORE_FLAG_NONE) );
    CHECK_RETURN(whd_disable_device_core(whd_driver, SOCRAM_CORE, WLAN_CORE_FLAG_NONE) );
    CHECK_RETURN(whd_reset_device_core(whd_driver, SOCRAM_CORE, WLAN_CORE_FLAG_NONE) );

    CHECK_RETURN(whd_chip_specific_socsram_init(whd_driver) );

    CHECK_RETURN(whd_bus_write_wifi_firmware_image(whd_driver) );
    CHECK_RETURN(whd_bus_write_wifi_nvram_image(whd_driver) );

    /* Take the ARM core out of reset */
    CHECK_RETURN(whd_reset_device_core(whd_driver, WLAN_ARM_CORE, WLAN_CORE_FLAG_NONE) );
    result = whd_device_core_is_up(whd_driver, WLAN_ARM_CORE);
    if (result != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("Could not bring ARM core up\n") );
        return result;
    }

    /* Wait until the HT clock is available */
    while ( ( (result =
                   whd_bus_spi_read_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_CHIP_CLOCK_CSR, (uint8_t)1,
                                                   &csr_val) ) == WHD_SUCCESS ) &&
            ( (csr_val & SBSDIO_HT_AVAIL) == 0 ) &&
            (loop_count < ( uint32_t )HT_AVAIL_TIMEOUT_MS) )
    {
        cy_rtos_delay_milliseconds( (uint32_t)1 );
        loop_count++;
    }
    if (loop_count >= ( uint32_t )HT_AVAIL_TIMEOUT_MS)
    {
        return WHD_TIMEOUT;
    }
    if (result != WHD_SUCCESS)
    {
        WPRINT_WHD_ERROR( ("HT clock not available\n") );
        return result;
    }

    /* Set up the interrupt mask and enable interrupts */
    CHECK_RETURN(whd_bus_spi_write_backplane_value(whd_driver, SDIO_INT_HOST_MASK, (uint8_t)4, I_HMB_SW_MASK) );

    /* Lower F2 Watermark to avoid DMA Hang in F2 when SD Clock is stopped. */
    return whd_bus_spi_write_register_value(whd_driver, BACKPLANE_FUNCTION, SDIO_FUNCTION2_WATERMARK, (uint8_t)1,
                                            ( uint32_t )SPI_F2_WATERMARK);
}

whd_result_t whd_bus_spi_wakeup(whd_driver_t whd_driver)
{
    uint32_t spi_bus_reg_value;

    /* Wake up WLAN SPI interface module */
    CHECK_RETURN(whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, sizeof(uint32_t),
                                                 (uint8_t *)&spi_bus_reg_value) );
    spi_bus_reg_value |= ( uint32_t )(WAKE_UP);
    return whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, sizeof(uint32_t),
                                            spi_bus_reg_value);
}

whd_result_t whd_bus_spi_sleep(whd_driver_t whd_driver)
{
    uint32_t spi_bus_reg_value;

    /* Put SPI interface block to sleep */
    CHECK_RETURN(whd_bus_spi_read_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, sizeof(uint32_t),
                                                 (uint8_t *)&spi_bus_reg_value) );
    spi_bus_reg_value &= ~( uint32_t )(WAKE_UP);
    return whd_bus_spi_write_register_value(whd_driver, BUS_FUNCTION, SPI_BUS_CONTROL, sizeof(uint32_t),
                                            spi_bus_reg_value);
}

void whd_bus_spi_init_stats(whd_driver_t whd_driver)
{

}

whd_result_t whd_bus_spi_print_stats(whd_driver_t whd_driver, whd_bool_t reset_after_print)
{
    return WHD_TRUE;
}

/* Waking the firmware up from Deep Sleep */
whd_result_t whd_bus_spi_reinit_stats(whd_driver_t whd_driver, whd_bool_t wake_from_firmware)
{
    return WHD_TRUE;
}

uint8_t whd_bus_spi_backplane_read_padd_size(whd_driver_t whd_driver)
{
    return WHD_BUS_SPI_BACKPLANE_READ_PADD_SIZE;
}

whd_bool_t whd_bus_spi_use_status_report_scheme(whd_driver_t whd_driver)
{
    return WHD_FALSE;
}

uint32_t whd_bus_spi_get_max_transfer_size(whd_driver_t whd_driver)
{
    return WHD_BUS_SPI_MAX_BACKPLANE_TRANSFER_SIZE;
}

void whd_bus_spi_oob_intr_asserted(whd_driver_t whd_driver)
{
    /* call thread notify to wake up WHD thread */
    whd_thread_notify_irq(whd_driver);
}

whd_result_t whd_bus_spi_irq_register(whd_driver_t whd_driver)
{
    UNUSED_PARAMETER(whd_driver);
    return WHD_TRUE;
}

whd_result_t whd_bus_spi_irq_enable(whd_driver_t whd_driver, whd_bool_t enable)
{
    const whd_variant_t oob_intr = whd_driver->bus_priv->spi_config.oob_intr;
    (*whd_driver->bus_priv->spi_ops->whd_enable_intr)(whd_driver, oob_intr, enable);
    return WHD_TRUE;
}

